backend/controllers/SalesController.php

SELECT * FROM `sales` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Sales::findOne($id)) !== null) {