backend/controllers/UserController.php

    public function actionIndex()
    {
        $branches = Branch::find()->all();
        $branchList = [];
        foreach ($branches as $each) {
            $branchList[$each->branch_code] = $each->name;
        }
        $users = User::find()->all();
---
SELECT * FROM `branch`
SELECT * FROM `user`