common/models/Points.php

SELECT * FROM `points` WHERE `user_id`='16'
INSERT INTO `points` (`user_id`, `points`, `created_at`, `updated_at`) VALUES (16, 32, 1501419215, 1501419215)
---
    public function addPoints($user_id, $pointsVal)
    {
        $points = Points::findOne(['user_id' => $user_id]);
        if ($points) {
            $totalPoints = floor($points->points + $pointsVal);
            $points->points = $totalPoints;
        } else {
            // Set up new points
            $points = new Points;
            $points->user_id = $user_id;
            $points->points = floor($pointsVal);
        }
        if ($points->save()) {

SELECT * FROM `user` WHERE `user_id`='16'
SELECT * FROM `user` WHERE `user_id`=11
---
    public function distributePoints($levels, $type = "+")
    {
        $me = User::findOne($this->user_id);
        // Check if there's extra points
        // If there is, then reset the extra points to 0 and add one level
        if (is_numeric($levels) && strpos($levels, '.') == true) {
            if($me->has_one_point == 0) {
                $me->has_one_point = 1;
            } elseif ($me->has_one_point == 1) {
                $me->has_one_point = 0;
                $levels = $levels + 1;
            }
        }
        // 2 points give 2 points to a parent level up to 15 levels.
        $user = [];
        $lastLevel = $me->last_level_given;
        $lastUser = $me->last_user_given;
        if (!$me->direct_upline) {
            return true;
        }
        if (!$lastUser) {
            $user[0] = $me->direct_upline;
        } else {
            $user[0] = User::findOne($lastUser)->direct_upline;

INSERT INTO `history` (`user_id`, `type`, `value`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES (14, 'points(16)', 2, 1501419215, 1501419215, 1, 1)
SELECT * FROM `user` WHERE `user_id`=14
---
                    $history->type = "points($this->user_id)";
                    $history->value = Yii::$app->appConfig->pointsPerLevel;
                }
                $history->save();
            }
            if ($direct_upline = User::findOne($user[$counter])->direct_upline) {

UPDATE `user` SET `last_level_given`=4, `last_user_given`=10, `updated_at`=1501419409 WHERE `user_id`=16
---
        return $user;
        $me->last_user_given = $user[$counter - 1];
        $me->last_level_given = $lastLevel;
        if ($me->save()) {