common/models/Sales.php

SELECT * FROM `sales` WHERE `user_id`='16'
---
    public function createSales()
    {
        if ($this->validate()) {
            $sale = Sales::findOne(['user_id' => $this->user_id]);

INSERT INTO `history` (`user_id`, `type`, `value`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES (16, 'sales', 16000, 1501419215, 1501419215, 1, 1)
INSERT INTO `sales` (`user_id`, `amount`, `created_at`, `updated_at`) VALUES (16, 16000, 1501419215, 1501419215)
UPDATE `sales` SET `amount`=20000, `updated_at`=1501419405 WHERE `id`=1
---
            ];
            // $points->load($pointsData);
            // return $points->savePoints();
            if ($sale->save() && $history->save() && $points->load($pointsData) && $points->savePoints()) {