common/models/User.php

SELECT EXISTS(SELECT * FROM `user` WHERE (`user`.`username`='DC129849'))
SELECT * FROM `user` WHERE `username`='DC129849'
INSERT INTO `user` (`username`, `firstname`, `middlename`, `lastname`, `created_at`, `updated_at`) VALUES ('DC129849', 'Adrian', 'Trasmonte', 'Saycon', 1501221924, 1501221924)
---
    public function signup()
    {
        if ($this->validate()) {
            $user = new User;

            do {
                $no = rand(100000,999999);
                $generated = "$this->branch$no";
            } while (User::findOne(['username' => $generated]));

            $user->username = $generated;
            $user->firstname = $this->firstname;
            $user->middlename = $this->middlename;
            $user->lastname = $this->lastname;

            if ($user->save()) {