backend/views/userc/_form.php

/* @var $model common\models\User */
/* @var $form yii\widgets\ActiveForm */

    $branches = \common\models\Branch::find()->all();
---
SELECT * FROM `branch`

    foreach ($branches as $each) {
        $branchList[$each->branch_code] = $each->name;
    }
    $users = \common\models\User::find()->all();
---
SELECT * FROM `user`