backend/views/sales/_form.php

SELECT * FROM `user`
---
/* @var $model common\models\Sales */
/* @var $form yii\widgets\ActiveForm */

    $users = \common\models\User::find()->all();