backend/views/sales/index.php

            'user_id',
            ['class' => 'yii\grid\SerialColumn'],

            ['label'=>'Username', 'value'=>function ($model, $index, $widget) {
                return ($model->user->username) . " " . $model->user->firstname . " " . $model->user->lastname;
            }],
---
SELECT * FROM `user` WHERE `user_id`=16