backend/views/points/index.php

<!--
    <p>
        <?php // Html::a('Create Points', ['create'], ['class' => 'btn btn-success']) ?>
    </p> -->
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            'user_id',

            ['label'=>'Username', 'value'=>function ($model, $index, $widget) {
                return "(" . $model->user->username . ") " . $model->user->firstname . " " . $model->user->lastname;
            }],

            'points',

            ['label'=>'Created At', 'value'=>function ($model, $index, $widget) {
                return date('m-d-Y (h:m:s)', $model->created_at);
            }],

            ['class' => 'yii\grid\ActionColumn'],
        ],
    ]); ?>
---
SELECT * FROM `points` LIMIT 20
SELECT COUNT(*) FROM `points`